# IsConceptualConstructionByEnergyData Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..IsConceptualConstructionByEnergyData Property
MassSurfaceData Class See Also
---
True when the ConceptualConstructionType id is synchronized to the EnergyDataSettings. False when the ConceptualConstructionType id is overridden for this MassSurfaceData.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsConceptualConstructionByEnergyData { get; set; }
```

Visual Basic
---
```text
Public Property IsConceptualConstructionByEnergyData As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsConceptualConstructionByEnergyData {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData. |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace